      *----------------------------------------------------------------*
      * PROGRAMA: PROGCOB01
      * AUTHOR  : EMANUEL
      * DATA    : 16.01.2023
      *----------------------------------------------------------------*
      * OBJETIVO: Receber e imprimir uma string utilizando a variável
      * de nivel 77.   
      *----------------------------------------------------------------*
      
      *----------------------------------------------------------------* 
       IDENTIFICATION       DIVISION.
      *----------------------------------------------------------------*
       PROGRAM-ID.          PROGCOB01.
      *----------------------------------------------------------------*
       ENVIRONMENT          DIVISION.
      *----------------------------------------------------------------* 
       DATA                 DIVISION.
      *----------------------------------------------------------------* 
       PROCEDURE            DIVISION.
       0001-PRINCIPAL.

           PERFORM 0100-INICIALIZAR.
           STOP RUN.

      *----------------------------------------------------------------* 
      *                   Inicializar o Programa                            
      *----------------------------------------------------------------*
       0100-INICIALIZAR.
           DISPLAY          "HELLO WORLD!".
      *----------------------------------------------------------------*
       


       