      *----------------------------------------------------------------*
      * PROGRAMA: PROGCOB03
      * AUTHOR  : EMANUEL
      * DATA    : 16.01.2023
      *----------------------------------------------------------------*
      * OBJETIVO: Receber e imprimir a data do sistem utilizando variá-
      * veis de nível 01, 03 (estruturada)
      *----------------------------------------------------------------*
       
      *----------------------------------------------------------------* 
       IDENTIFICATION       DIVISION.
      *----------------------------------------------------------------*
       PROGRAM-ID.          PROGCOB03.
      *----------------------------------------------------------------*
       ENVIRONMENT          DIVISION.
      *----------------------------------------------------------------* 
       DATA                 DIVISION.
      *----------------------------------------------------------------* 
       WORKING-STORAGE      SECTION. 
          01 WRK-DATA.
          03 WRK-AN0        PIC 9(04) VALUE ZEROS.
          03 WRK-MES        PIC 9(02) VALUE ZEROS.
          03 WRK-DIA        PIC 9(02) VALUE ZEROS.
      *----------------------------------------------------------------*
       PROCEDURE            DIVISION.
      *----------------------------------------------------------------*
           INITIALIZE       WRK-DATA.
           ACCEPT           WRK-DATA FROM DATE YYYYMMDD .
      *----------------------------------------------------------------* 
      *                 Mostrar os Dados                               *
      *----------------------------------------------------------------* 
           DISPLAY 'DATA: ' WRK-DIA ' DE ' WRK-MES ' DE ' WRK-AN0.
           STOP RUN.